20250618T233353--kdoc-399-『postgresql-170』__draft_book.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-06-19T08:54:02Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 399: 『PostgreSQL 17.0』</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 399: 『PostgreSQL 17.0』</h1>
<div id="outline-container-org0cfae32" class="outline-2">
<h2 id="org0cfae32"><a href="#org0cfae32">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org0cfae32">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>

<ul class="org-ul">
<li>レビュー
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6c94af8" class="outline-2">
<h2 id="org6c94af8"><a href="#org6c94af8">概要</a></h2>
<div class="outline-text-2" id="text-org6c94af8">
<p>
<a href="https://pgsql-jp.github.io/jpug-doc/17.0/postgresql-17.0-A4.pdf">PostgreSQL 17.0文書</a>は、PostgreSQLのマニュアル。
</p>
</div>
</div>
<div id="outline-container-orgfa7ef24" class="outline-2">
<h2 id="orgfa7ef24"><a href="#orgfa7ef24">メモ</a></h2>
<div class="outline-text-2" id="text-orgfa7ef24">
<ul class="org-ul">
<li>PostgreSQLはクライアント/サーバモデルを採用している。クライアントとサーバのホストが異なる場合、TCP/IPネットワーク経由で通信する(p4)
<ul class="org-ul">
<li>(感想)ホストが同じ場合はソケット接続という理解で合っているか</li>
</ul></li>
<li>サーバは接続ごとに新しいプロセスを開始(fork)する。これによってクライアントからの複数同時接続を取り扱える(p4)</li>
<li>左外部結合というのは、結合演算子の左側に指定したテーブルの各行が最低でも1度出力されるから。いっぽう右側では左側のテーブルの行に一致するもののみが出力される(p14)</li>
</ul>
</div>
</div>
<div id="outline-container-org8bd888d" class="outline-2">
<h2 id="org8bd888d"><a href="#org8bd888d">関連</a></h2>
<div class="outline-text-2" id="text-org8bd888d">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
